<pre>
کپی‌رایت (c) از سال ۲۰۲۴، اینوشاپ

این سیستم متن‌باز است و می‌تواند به صورت رایگان مورد استفاده تجاری قرار گیرد. پروانه متن‌باز مبتنی بر مجوز نرم‌افزاری Open Software License (OSL-3.0) است: https://opensource.org/license/osl-3-0
شرایط استفاده:
۱) باید فایل مجوز LICENSE.txt در شاخه اصلی حفظ شود و نباید تغییر یابد.
۲) باید اطلاعات کپی‌رایت در کامنت‌های کد حفظ شود و نباید حذف یا تغییر داده شود.
۳) بازارچه افزونه رسمی که در سیستم وجود دارد باید دست‌نخورده باقی بماند و حذف یا تغییر نیابد.
۴) اگر نیاز به تغییر در بندهای بالا دارید، باید مجوز جداگانه از تیم رسمی بگیرید.

این مجوز برای هر اثری که توسط مالک اصلی با ذکر این مجوز منتشر شده باشد معتبر است.

بر اساس OSL-3.0 مجوزهای زیر صادر می‌شود:
۱) کپی‌رایت: شما می‌توانید به صورت جهانی، بدون پرداخت حق امتیاز و به شکل غیر انحصاری و قابل انتقال:
- اثر اصلی را کپی کنید، چه به تنهایی چه به صورت بخشی از اثری دیگر
- اثر را ترجمه، اقتباس یا تغییر دهید و آثار مشتق‌شده خلق کنید
- آثار اصلی و مشتق‌شده را توزیع کرده یا منتشر نمایید، مشروط به اینکه آن‌ها نیز تابع همین مجوز باشند
- اثر را به صورت عمومی اجرا و نمایش دهید
۲) مجوزهای پتنت: مالک اصلی به شما مجوز ساخت، استفاده، فروش و واردات اثر اصلی و مشتق‌شده را در دوره اعتبار پتنت اعطا می‌کند.
۳) مجوز سورس: «سورس کد» به معنای ترجیحی‌ترین قالب برای ویرایش و همچنین تمام اسنادی است که نحوه ویرایش را توضیح می‌دهند. مالک اصلی متعهد می‌شود هنگام انتشار اثر اصلی، یک نسخه خوانا از سورس را نیز ارائه دهد.
۴) حذف نام و علامت تجاری: بدون اجازه رسمی نمی‌توانید از نام یا لوگوی سازنده یا مشارکت‌کنندگان برای تبلیغ محصولات مشتق‌شده استفاده کنید.
۵) استفاده خارجی: هرگونه استفاده یا انتشار بیرونی باید طبق بند توزیع مجوز باشد.
۶) اطلاع‌رسانی: باید تمام اطلاعات کپی‌رایت و مجوز را در آثار مشتق‌شده حفظ کنید و ذکر نمایید که شما تغییراتی ایجاد نموده‌اید.
۷) سلب مسئولیت: اثر به صورت «همان‌گونه که هست» ارائه می‌شود و هیچ ضمانتی اعم از تجاری بودن یا عدم نقض وجود ندارد. تمامی ریسک بر عهده استفاده‌کننده است.
۸) محدودیت مسئولیت: تحت هیچ شرایطی سازنده مسئول خسارات غیرمستقیم یا خاص نیست. در صورتی که قانون این محدودیت را مجاز ندارد، قابل اعمال نخواهد بود.
۹) پذیرش و خاتمه: توزیع یا استفاده به منزله پذیرش کامل شرایط این مجوز است؛ عدم رعایت باعث خاتمه خودکار مجوز می‌شود.
۱۰) دعاوی پتنت: اگر علیه مالک یا مشارکت‌کننده طرح دعوی کنید، مجوز به صورت خودکار قطع می‌شود.
۱۱) صلاحیت قضایی: دعاوی مرتبط فقط در دادگاه‌های محل سکونت سازنده قابل طرح است.
۱۲) مخارج حقوقی: برنده دعاوی ناشی از این مجوز می‌تواند هزینه‌های خود را پس بگیرد.
۱۳) سایر شرایط در صورت غیرقابل اجرا بودن فقط تا حد لازم تغییر می‌یابد.
۱۴) «شما» چه فرد حقیقی چه حقوقی باشید، به معنای دریافت کننده دارای حق استفاده، مشروط به رعایت همه بندهاست.
۱۵) هر گونه استفاده مجاز است مگر اینکه قانون یا این مجوز مانع شود.
۱۶) اجازه بازتولید و توزیع مجوز اصلی به شرط عدم تغییر متن مجاز است، اما ایجاد مجوز جدید با نام مشابه ممنوع است مگر با تصویب OSI.
</pre>